{"_path":"/posts/ai-zero-to-hero-week-1","_dir":"posts","_draft":false,"_partial":false,"_locale":"","title":"AI Zero to Hero Week 1: Fear of missing out on the AI train and what I'm doing about it","description":"I kept procrastinating learning ML because I either thought I was too late or not smart enough... Time to stop that.","link":"ai-zero-to-hero-week-1","date":"2024-07-04T00:00:00.000Z","timeToRead":6,"thumbnail":"ai-zero-to-hero/extrapolation.png","tags":["Programming"],"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"During college, I had the fear of missing out on understanding machine learning because I didn't take enough classes or do any research related to it."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"After graduating, I had the fear of missing out because I didn't end up doing a masters or getting a job in a field related to ML."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A few years later I had the fear of missing out because everyone else in the field seemed so far ahead of me and I had only watched a handful of of Andrew Ng's lectures before moving on."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Then ChatGPT came out and I felt like we were already in the future way beyond anything I could possibly comprehend. Papers about architectures like transformers were over 5 years old and they went completely over my head."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"And now it's almost 2 years later and I finally realized that I can't keep waiting around saying it's too late. A lot of people are doing incredible things with AI and machine learning despite starting only a few years ago. You're only about 20 books behind the most cracked person in any field. Now that's no simple feat, but I can't avoid the fact that if I had started my journey 5 years earlier when I started feeling left out, I probably would have been a lot further along."}]},{"type":"element","tag":"img","props":{"alt":"https://xkcd.com/1768/ - Settling","src":"https://imgs.xkcd.com/comics/settling.png","width":"30%"},"children":[]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So with that preamble out of the way, here's week 1 of my progress:"}]},{"type":"element","tag":"h2","props":{"id":"courses"},"children":[{"type":"text","value":"Courses"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We don't deserve Andrej Karpathy. Someone with his credentials could probably be spending their time solving complex, novel problems. Instead, he's educating beginners and making one of the best introductions to neural networks I've ever seen. Even now, his work on "},{"type":"element","tag":"a","props":{"href":"https://github.com/karpathy/llm.c","rel":["nofollow"],"target":"_blank"},"children":[{"type":"text","value":"llm.c"}]},{"type":"text","value":" seems to primarily be a tool for teaching how transformers work."}]},{"type":"element","tag":"h3","props":{"id":"micrograd"},"children":[{"type":"text","value":"micrograd"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"micrograd was a great primer into how back propagation works with a dynamically constructed set of operations. In the past, I had built multi-layer perceptrons using matrices and knew how to back propagate those but I didn't understand how libraries like pytorch were able to figure out how to compute gradients on arbitrary network with things like softmax, activation functions, etc., built in. Now I know that it's just the chain rule (with a veeeery long chain). As long as you can compute the forward and backward passes of an operation, you can throw it into the computation graph."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The lesson ends off with building an actual neural network and training it on a toy problem. Despite the simplicity of the network, actually understanding how it works under the hood is critical in understanding later concepts which come up when scaling up the network. For example, dead neurons appear when the gradient of the activation function is 0. You could take this as a fact, or you could go back to the lesson about back propagation and the chain rule and realize why that's the case."}]},{"type":"element","tag":"h3","props":{"id":"makemore"},"children":[{"type":"text","value":"makemore"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"makemore is a really great follow up to micrograd because while micrograd teaches you how to build pytorch under the hood, makemore explains how to use it. Without micrograd, makemore would make a lot less sense, and without makemore, micrograd would have little to no motivation."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These lesson go more into depth about training an actual model, explaining concepts like loss, regularization, test/train/dev split, batching, learning rate adjustment, how to initialize the weights and biases of the network, and more (I still haven't finished it)."}]},{"type":"element","tag":"h2","props":{"id":"reading-papers"},"children":[{"type":"text","value":"Reading papers"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"I re-read the "},{"type":"element","tag":"a","props":{"href":"https://arxiv.org/pdf/1706.03762","rel":["nofollow"],"target":"_blank"},"children":[{"type":"text","value":"Attention is All You Need"}]},{"type":"text","value":" paper. The last time I read it, I sort of knew what a neural network is and could tell you the equations for regularization (enough to pass classes) but barely had an intuition for how it worked. A lot still went over my head on the second read but now it makes much more sense. It kind of reminds me of when I was a kid interested in computers and reading some Wikipedia articles and feeling like they were way more complex than they needed to be. But as an adult with years of computer science context, it turns out that those Wikipedia articles were actually pretty succinct and I was just a dumb little kid. I'm looking forward to coming back to papers like this and fully understanding them enough to reimplement them. Nothing is insurmountable."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Read "},{"type":"element","tag":"a","props":{"href":"https://www.jmlr.org/papers/volume3/bengio03a/bengio03a.pdf","rel":["nofollow"],"target":"_blank"},"children":[{"type":"text","value":"https://www.jmlr.org/papers/volume3/bengio03a/bengio03a.pdf"}]},{"type":"text","value":". This one is a much simpler paper but I can also tell that a lot of parts would have gone well over my head if I had tried reading it a month ago. It also probably helps that I literally just implemented it. Being somewhat of a seminal paper, it doesn't have to build off on that much prior knowledge. Instead, a lot of the terminology that it uses is stuff that I almost take for granted at this point (like using vectors and matrices to represent certain concepts like layers and inputs)"}]}]},{"type":"element","tag":"h2","props":{"id":"personal-projects"},"children":[{"type":"text","value":"Personal Projects"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I haven't worked on anything here yet unless you count making small tweaks to the makemore code or building a 4-gram model to compare against the MLP model. I'm assuming in the future I'll have something to put here so for the sake of consistency I'll leave this empty section here."}]},{"type":"element","tag":"h2","props":{"id":"other-neat-things-ive-learned"},"children":[{"type":"text","value":"Other neat things I've learned"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"People are way over hyped about AGI and making wild extrapolations. Learning more about the math made me realize that a lot of people who talk about AI are probably talking out of their asses in the same way that a lot of crypto grifters barely understand how distributed systems work."}]},{"type":"element","tag":"img","props":{"alt":"Extrapolation","src":"/posts/ai-zero-to-hero/extrapolation.png","width":"40%"},"children":[]},{"type":"element","tag":"h2","props":{"id":"life"},"children":[{"type":"text","value":"Life"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"I'm packing up for a vacation and also having friends over so a lot of free time went towards errands like cleaning."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Also playing Hades 2 (great game but eating into time I could be learning more)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Plus I have a job so that shrinks my free time pretty considerably. Most of the things I listed above happened over one and a half weekends."}]}]},{"type":"element","tag":"blockquote","props":{"className":["twitter-tweet"]},"children":[{"type":"element","tag":"p","props":{"lang":"en","dir":"ltr"},"children":[{"type":"text","value":"I wrote about how I came to terms with being \"behind\" everyone else in ML/AI and what I'm doing to fix that. I spent the last 8 years telling myself that I was either too late or that I wasn't smart enough but I figure everyone starts somewhere."},{"type":"element","tag":"a","props":{"href":"https://t.co/Rkk5Mbnjpi"},"children":[{"type":"text","value":"https://t.co/Rkk5Mbnjpi"}]}]},{"type":"text","value":"— preethamrn (@preethamrn) "},{"type":"element","tag":"a","props":{"href":"https://twitter.com/preethamrn/status/1809073849927151915?ref_src=twsrc%5Etfw"},"children":[{"type":"text","value":"July 5, 2024"}]}]},{"type":"text","value":" "},{"type":"element","tag":"script","props":{"async":true,"src":"https://platform.twitter.com/widgets.js","charSet":"utf-8"},"children":[]},{"type":"text","value":" "}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"courses","depth":2,"text":"Courses","children":[{"id":"micrograd","depth":3,"text":"micrograd"},{"id":"makemore","depth":3,"text":"makemore"}]},{"id":"reading-papers","depth":2,"text":"Reading papers"},{"id":"personal-projects","depth":2,"text":"Personal Projects"},{"id":"other-neat-things-ive-learned","depth":2,"text":"Other neat things I've learned"},{"id":"life","depth":2,"text":"Life"}]}},"_type":"markdown","_id":"content:posts:ai-zero-to-hero-week-1.md","_source":"content","_file":"posts/ai-zero-to-hero-week-1.md","_extension":"md"}